In [33]:
# 판다스 주입
import pandas as pd

In [34]:
# 열 선언
menu = pd.Series(['아메리카노', '카페라떼', '카페모카', '카푸치노', '에스프레소', '밀크티', '녹차'])
price = pd.Series([4500, 5000, 5500, 5000, 4000, 5900, 5300])
calory = pd.Series([10, 110, 250, 110, 20, 210, 0])

In [35]:
# 데이터프레임 생성
df = pd.DataFrame({
    "메뉴": menu,
    "가격": price,
    "칼로리": calory,
})

In [36]:
# csv파일로 변환
df.to_csv('./ch1', index=False)

In [37]:
# csv파일 변수저장
df = pd.read_csv('./ch1')

In [38]:
# 데이터 확인 1
df.head() # default: 5개

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110
2   카페모카  5500  250
3   카푸치노  5000  110
4  에스프레소  4000   20

In [39]:
# 데이터 확인 2
df.head(2) # 앞에서 2개

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110

In [40]:
# 데이터 확인 3
df.tail(3) # 뒤에서 3개

      메뉴    가격  칼로리
4  에스프레소  4000   20
5    밀크티  5900  210
6     녹차  5300    0

In [41]:
# 데이터 확인 4
df.sample(4) # 랜덤 4개

     메뉴    가격  칼로리
6    녹차  5300    0
3  카푸치노  5000  110
5   밀크티  5900  210
2  카페모카  5500  250

In [42]:
# df 크기
df.shape # (row, col)

(7, 3)

In [43]:
# df 정보
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      7 non-null      object
 1   가격      7 non-null      int64
 2   칼로리     7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 300.0+ bytes

In [44]:
# 상관관계 확인
df.corr(numeric_only=True) # object 컬럼이 있기 때문에 numeric_only 옵션 적용

           가격       칼로리
가격   1.000000  0.713227
칼로리  0.713227  1.000000

In [45]:
# 기초 통계 3
df.describe(include='O') # 문자열만 통계

           메뉴
count       7
unique      7
top     아메리카노
freq        1